## SQL Fundamentals

### What is Database ?
    A Database is an organized collection of structured information, or data, typically stored electronically in a computer system. Think of it as a digital filing cabinet. While a spreadsheet (like Excel) is great for one person to calculate numbers, a database is designed to hold massive amounts of data that many users can access and update at the same time securely.

### What is SQL
    SQL (pronounced "sequel" or "S-Q-L") is the standard programming language used to communicate with and manage a relational database. If the database is the filing cabinet, SQL is the language you use to tell the cabinet to "give me all files from 2023" or "add a new file for customer John Doe."

### Database Coonection

In [50]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:@localhost/test

### Version check

In [53]:
%%sql
SELECT version();

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

         version()
0  10.4.32-MariaDB

### Create table students

In [56]:
%%sql 

CREATE TABLE students (
    student_id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    gender CHAR(1),
    course VARCHAR(50),
    score INT,
    join_date DATE
);

 * mysql+pymysql://root:***@localhost/test
0 rows affected.

Empty DataFrame
Columns: []
Index: []

### Insert Data

In [59]:
%%sql  

INSERT INTO students VALUES
(1, 'Rahul', 20, 'M', 'Data Science', 85, '2024-01-10'),
(2, 'Asha', 22, 'F', 'Python', 90, '2024-02-05'),
(3, 'Aman', 21, 'M', 'SQL', NULL, '2024-03-01'),
(4, 'Neha', 23, 'F', 'Data Science', 88, NULL),
(5, 'Riya', 20, 'F', 'SQL', 92, '2024-01-25');

 * mysql+pymysql://root:***@localhost/test
5 rows affected.

Empty DataFrame
Columns: []
Index: []

### Viewing Data

In [62]:
%%sql 
SELECT * FROM students;

 * mysql+pymysql://root:***@localhost/test
5 rows affected.

   student_id   name  age gender        course  score   join_date
0           1  Rahul   20      M  Data Science   85.0  2024-01-10
1           2   Asha   22      F        Python   90.0  2024-02-05
2           3   Aman   21      M           SQL    NaN  2024-03-01
3           4   Neha   23      F  Data Science   88.0        None
4           5   Riya   20      F           SQL   92.0  2024-01-25

### Display selected columns

In [65]:
%%sql
SELECT name,age,gender from students;

 * mysql+pymysql://root:***@localhost/test
5 rows affected.

    name  age gender
0  Rahul   20      M
1   Asha   22      F
2   Aman   21      M
3   Neha   23      F
4   Riya   20      F